CSI API ETABS v1

# cSapModelConstraintDef Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cConstraint ConstraintDef { get; }

    ReadOnly Property ConstraintDef As cConstraint
    	Get

    Dim instance As cSapModel
    Dim value As cConstraint

    value = instance.ConstraintDef

    property cConstraint^ ConstraintDef {
    	cConstraint^ get ();
    }

    abstract ConstraintDef : cConstraint with get

#### Property Value

Type: cConstraint

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com